[Killed] Equality mutation
ESM.Core/Boards/Board.cs:34:77
         /// <returns>Boolean</returns>
         public bool IsValid(IPoint point)
         {
-            return point != null && point.X >= 0 && point.X <= Size.MaxX && point.Y >= 0 && point.Y <= Size.MaxY;
+            return point != null && point.X >= 0 && point.X <= Size.MaxX && point.Y > 0  && point.Y <= Size.MaxY;
         }
         #endregion

[Killed] Equality mutation
ESM.Core/Boards/Board.cs:34:53
         /// <returns>Boolean</returns>
         public bool IsValid(IPoint point)
         {
-            return point != null && point.X >= 0 && point.X <= Size.MaxX && point.Y >= 0 && point.Y <= Size.MaxY;
+            return point != null && point.X >= 0 && point.X < Size.MaxX  && point.Y >= 0 && point.Y <= Size.MaxY;
         }
         #endregion
