[Killed] Negate expression
ESM.Core/Boards/Exit.cs:26:17
         /// <param name="point">Point</param>
         public void Set(IBoard board, Point point)
         {
-            if (board.IsValid(point))
+            if (!(board.IsValid(point)))
             {
                 Point = point;
