[NoCoverage] Negate expression
ESM.Core/Infrastructure/FileProvider.cs:31:27
             path = path.Replace("~/", string.Empty).TrimStart('/');
 
             //if virtual path has slash on the end, it should be after transform the virtual path to physical path too
-            var pathEnd = path.EndsWith('/') ? Path.DirectorySeparatorChar.ToString() : string.Empty;
+            var pathEnd = !(path.EndsWith('/') ) ? Path.DirectorySeparatorChar.ToString() : string.Empty;
 
             return Combine(path) + pathEnd;

[NoCoverage] String mutation
ESM.Core/Infrastructure/FileProvider.cs:31:89
             path = path.Replace("~/", string.Empty).TrimStart('/');
 
             //if virtual path has slash on the end, it should be after transform the virtual path to physical path too
-            var pathEnd = path.EndsWith('/') ? Path.DirectorySeparatorChar.ToString() : string.Empty;
+            var pathEnd = path.EndsWith('/') ? Path.DirectorySeparatorChar.ToString() : "Stryker was here!";
 
             return Combine(path) + pathEnd;

[NoCoverage] Negate expression
ESM.Core/Infrastructure/FileProvider.cs:56:17
         /// </returns>
         public virtual string[] GetFiles(string directoryPath, string searchPattern = "", bool topDirectoryOnly = true)
         {
-            if (string.IsNullOrEmpty(searchPattern))
+            if (!(string.IsNullOrEmpty(searchPattern)))
                 searchPattern = "*.*";
 

[NoCoverage] Boolean mutation
ESM.Core/Infrastructure/FileProvider.cs:62:42
             return Directory.GetFileSystemEntries(directoryPath, searchPattern,
                 new EnumerationOptions
                 {
-                    IgnoreInaccessible = true,
+                    IgnoreInaccessible = false,
                     MatchCasing = MatchCasing.CaseInsensitive,
                     RecurseSubdirectories = !topDirectoryOnly,

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ESM.Core/Infrastructure/FileProvider.cs:64:45
                 {
                     IgnoreInaccessible = true,
                     MatchCasing = MatchCasing.CaseInsensitive,
-                    RecurseSubdirectories = !topDirectoryOnly,
+                    RecurseSubdirectories = topDirectoryOnly,
 
                 });
