[Killed] Equality mutation
ESM.Core/Animals/AnimalValidator.cs:12:16
     {
         public void IsValidAnimalStartingPoint(IList<string> listOfDirections, string animalStartingPoint, string separator = "")
         {
-            if(listOfDirections == null || listOfDirections.Count <= 0)
+            if(listOfDirections != null  || listOfDirections.Count <= 0)
                 throw new ArgumentNullException(null,"List of directions parameter cannot be null or empty");
 

[Killed] Equality mutation
ESM.Core/Animals/AnimalValidator.cs:12:44
     {
         public void IsValidAnimalStartingPoint(IList<string> listOfDirections, string animalStartingPoint, string separator = "")
         {
-            if(listOfDirections == null || listOfDirections.Count <= 0)
+            if(listOfDirections == null || listOfDirections.Count < 0)
                 throw new ArgumentNullException(null,"List of directions parameter cannot be null or empty");
 

[Killed] Negate expression
ESM.Core/Animals/AnimalValidator.cs:15:16
             if(listOfDirections == null || listOfDirections.Count <= 0)
                 throw new ArgumentNullException(null,"List of directions parameter cannot be null or empty");
 
-            if(string.IsNullOrWhiteSpace(animalStartingPoint))
+            if(!(string.IsNullOrWhiteSpace(animalStartingPoint)))
                 throw new ArgumentNullException(null,"Animal starting point parameter cannot be null or empty");
 

[Killed] String mutation
ESM.Core/Animals/AnimalValidator.cs:16:54
                 throw new ArgumentNullException(null,"List of directions parameter cannot be null or empty");
 
             if(string.IsNullOrWhiteSpace(animalStartingPoint))
-                throw new ArgumentNullException(null,"Animal starting point parameter cannot be null or empty");
+                throw new ArgumentNullException(null,"");
 
             var directionsString = string.Join(separator, listOfDirections);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ESM.Core/Animals/AnimalValidator.cs:20:16
 
             var directionsString = string.Join(separator, listOfDirections);
             var pattern = new Regex(@"^\d+ \d+ [" + directionsString + "]$").IsMatch(animalStartingPoint);
-            if(!pattern)
+            if(pattern)
                 throw new PatternValidationException("Direction parameters are not matching with animal starting point format");
 

[Killed] Logical mutation
ESM.Core/Animals/AnimalValidator.cs:26:17
         }
         public void IsValidAnimalMovements(IList<string> listOfMovements, string animalMovements, string seperator = " ")
         {
-            if (listOfMovements == null || listOfMovements.Count <= 0)
+            if (listOfMovements == null && listOfMovements.Count <= 0)
                 throw new ArgumentNullException(null,"List of movements parameter cannot be null or empty");
 

[Killed] Equality mutation
ESM.Core/Animals/AnimalValidator.cs:26:17
         }
         public void IsValidAnimalMovements(IList<string> listOfMovements, string animalMovements, string seperator = " ")
         {
-            if (listOfMovements == null || listOfMovements.Count <= 0)
+            if (listOfMovements != null  || listOfMovements.Count <= 0)
                 throw new ArgumentNullException(null,"List of movements parameter cannot be null or empty");
 

[Killed] Negate expression
ESM.Core/Animals/AnimalValidator.cs:29:17
             if (listOfMovements == null || listOfMovements.Count <= 0)
                 throw new ArgumentNullException(null,"List of movements parameter cannot be null or empty");
 
-            if (string.IsNullOrWhiteSpace(animalMovements))
+            if (!(string.IsNullOrWhiteSpace(animalMovements)))
                 throw new ArgumentNullException(null,"Animal movements parameter cannot be null or empty");
 

[Killed] String mutation
ESM.Core/Animals/AnimalValidator.cs:30:54
                 throw new ArgumentNullException(null,"List of movements parameter cannot be null or empty");
 
             if (string.IsNullOrWhiteSpace(animalMovements))
-                throw new ArgumentNullException(null,"Animal movements parameter cannot be null or empty");
+                throw new ArgumentNullException(null,"");
 
             var movementsString = string.Join(seperator, listOfMovements);

[Killed] String mutation
ESM.Core/Animals/AnimalValidator.cs:33:63
                 throw new ArgumentNullException(null,"Animal movements parameter cannot be null or empty");
 
             var movementsString = string.Join(seperator, listOfMovements);
-            var pattern = new Regex(@"^[" + movementsString + "]+$").IsMatch(animalMovements);
+            var pattern = new Regex(@"^[" + movementsString + "").IsMatch(animalMovements);
             if (!pattern)
                 throw new PatternValidationException("Movement parameters are not matching with animal movements format");

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ESM.Core/Animals/AnimalValidator.cs:34:17
 
             var movementsString = string.Join(seperator, listOfMovements);
             var pattern = new Regex(@"^[" + movementsString + "]+$").IsMatch(animalMovements);
-            if (!pattern)
+            if (pattern)
                 throw new PatternValidationException("Movement parameters are not matching with animal movements format");
         }

[Killed] String mutation
ESM.Core/Animals/AnimalValidator.cs:35:54
             var movementsString = string.Join(seperator, listOfMovements);
             var pattern = new Regex(@"^[" + movementsString + "]+$").IsMatch(animalMovements);
             if (!pattern)
-                throw new PatternValidationException("Movement parameters are not matching with animal movements format");
+                throw new PatternValidationException("");
         }
 
