[Killed] Negate expression
ESM.Core/Boards/BoardValidator.cs:11:17
     {
         public void IsValidBoardSize(string boardSize)
         {
-            if (string.IsNullOrWhiteSpace(boardSize))
+            if (!(string.IsNullOrWhiteSpace(boardSize)))
                 throw new ArgumentNullException(null,"Board size parameter cannot be null or empty");
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ESM.Core/Boards/BoardValidator.cs:15:17
                 throw new ArgumentNullException(null,"Board size parameter cannot be null or empty");
 
             var pattern = new Regex(@"^\d+ \d+$").IsMatch(boardSize);
-            if (!pattern)
+            if (pattern)
                 throw new PatternValidationException("Board size parameter pattern is not valid");
         }
