[Killed] Negate expression
ESM.Core/Boards/ExitValidator.cs:11:17
     {
         public void IsValidExitPoint(string exitPoint)
         {
-            if (string.IsNullOrWhiteSpace(exitPoint))
+            if (!(string.IsNullOrWhiteSpace(exitPoint)))
                 throw new ArgumentNullException(null,"Exit point parameter cannot be null or empty");
 

[Killed] String mutation
ESM.Core/Boards/ExitValidator.cs:12:54
         public void IsValidExitPoint(string exitPoint)
         {
             if (string.IsNullOrWhiteSpace(exitPoint))
-                throw new ArgumentNullException(null,"Exit point parameter cannot be null or empty");
+                throw new ArgumentNullException(null,"");
 
             var pattern = new Regex(@"^\d+ \d+$").IsMatch(exitPoint);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ESM.Core/Boards/ExitValidator.cs:15:17
                 throw new ArgumentNullException(null,"Exit point parameter cannot be null or empty");
 
             var pattern = new Regex(@"^\d+ \d+$").IsMatch(exitPoint);
-            if (!pattern)
+            if (pattern)
                 throw new PatternValidationException("Exit point parameter pattern is not valid");
         }
