[Killed] Negate expression
ESM.Core/Obstacles/ObstaclesValidator.cs:11:17
     {
         public void IsValidListOfObstacles(string listOfObstacles)
         {
-            if (string.IsNullOrWhiteSpace(listOfObstacles))
+            if (!(string.IsNullOrWhiteSpace(listOfObstacles)))
                 throw new ArgumentNullException(null,"List of obstacles parameter cannot be null or empty");
 

[Killed] String mutation
ESM.Core/Obstacles/ObstaclesValidator.cs:12:54
         public void IsValidListOfObstacles(string listOfObstacles)
         {
             if (string.IsNullOrWhiteSpace(listOfObstacles))
-                throw new ArgumentNullException(null,"List of obstacles parameter cannot be null or empty");
+                throw new ArgumentNullException(null,"");
 
             var pattern = new Regex(@"").IsMatch(listOfObstacles);

[Killed] String mutation
ESM.Core/Obstacles/ObstaclesValidator.cs:14:37
             if (string.IsNullOrWhiteSpace(listOfObstacles))
                 throw new ArgumentNullException(null,"List of obstacles parameter cannot be null or empty");
 
-            var pattern = new Regex(@"").IsMatch(listOfObstacles);
+            var pattern = new Regex("Stryker was here!").IsMatch(listOfObstacles);
             if (!pattern)
                 throw new PatternValidationException("List of obstacles parameter pattern is not valid");

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ESM.Core/Obstacles/ObstaclesValidator.cs:15:17
                 throw new ArgumentNullException(null,"List of obstacles parameter cannot be null or empty");
 
             var pattern = new Regex(@"").IsMatch(listOfObstacles);
-            if (!pattern)
+            if (pattern)
                 throw new PatternValidationException("List of obstacles parameter pattern is not valid");
         }
