[Killed] String mutation
ESM.Services/Services/Turtle.cs:54:52
             if (board.IsValid(point))
                 Point = point;
             else
-                throw new PointValidationException("Turtle point is not valid!");
+                throw new PointValidationException("");
 
             Board = board;

[Killed] Boolean mutation
ESM.Services/Services/Turtle.cs:67:29
         /// <param name="exit">Exit</param>
         public void Move(IEnumerable<Movement> movements, IEnumerable<IMine> mines, IExit exit)
         {
-            var isHitMine = false;
+            var isHitMine = true;
             var isExit = false;
 

[Killed] Boolean mutation
ESM.Services/Services/Turtle.cs:68:26
         public void Move(IEnumerable<Movement> movements, IEnumerable<IMine> mines, IExit exit)
         {
             var isHitMine = false;
-            var isExit = false;
+            var isExit = true;
 
             foreach (var movement in movements)

[Killed] Equality mutation
ESM.Services/Services/Turtle.cs:72:21
 
             foreach (var movement in movements)
             {
-                if (movement == Movement.Move)
+                if (movement != Movement.Move)
                 {
                     // Make sure the turtle still in the board.

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ESM.Services/Services/Turtle.cs:75:25
                 if (movement == Movement.Move)
                 {
                     // Make sure the turtle still in the board.
-                    if (!Board.IsValid(Point))
+                    if (Board.IsValid(Point))
                         throw new PointValidationException("Turtle cannot go out of board!");
 

[Killed] String mutation
ESM.Services/Services/Turtle.cs:76:60
                 {
                     // Make sure the turtle still in the board.
                     if (!Board.IsValid(Point))
-                        throw new PointValidationException("Turtle cannot go out of board!");
+                        throw new PointValidationException("");
 
                     // Move the turtle to the next tile.

[Killed] Negate expression
ESM.Services/Services/Turtle.cs:82:25
                     _turtleMoveService.MoveForward(Point);
 
                     // If the turtle hits the mine it will not continue.
-                    if (_turtleMoveService.IsObstacleHit(Point, mines))
+                    if (!(_turtleMoveService.IsObstacleHit(Point, mines)))
                     {
                         Result = $"Mine Hit";

[Killed] String mutation
ESM.Services/Services/Turtle.cs:84:34
                     // If the turtle hits the mine it will not continue.
                     if (_turtleMoveService.IsObstacleHit(Point, mines))
                     {
-                        Result = $"Mine Hit";
+                        Result = $"";
                         isHitMine = true;
                         break;

[Killed] Boolean mutation
ESM.Services/Services/Turtle.cs:85:37
                     if (_turtleMoveService.IsObstacleHit(Point, mines))
                     {
                         Result = $"Mine Hit";
-                        isHitMine = true;
+                        isHitMine = false;
                         break;
                     }

[Killed] Negate expression
ESM.Services/Services/Turtle.cs:90:25
                     }
 
                     // If the turtle finds the exit it will not continue.
-                    if (_turtleMoveService.IsExit(Point, exit))
+                    if (!(_turtleMoveService.IsExit(Point, exit)))
                     {
                         Result = $"Success";

[Killed] Boolean mutation
ESM.Services/Services/Turtle.cs:93:34
                     if (_turtleMoveService.IsExit(Point, exit))
                     {
                         Result = $"Success";
-                        isExit = true;
+                        isExit = false;
                         break;
                     }

[Killed] Equality mutation
ESM.Services/Services/Turtle.cs:97:26
                         break;
                     }
                 }
-                else if (movement == Movement.Left)
+                else if (movement != Movement.Left)
                 {
                     // Turn left the turtle.

[Killed] Equality mutation
ESM.Services/Services/Turtle.cs:102:26
                     // Turn left the turtle.
                     _turtleMoveService.MoveLeft(Point);
                 }
-                else if (movement == Movement.Right)
+                else if (movement != Movement.Right)
                 {
                     // Turn right the turtle.

[Killed] Logical mutation
ESM.Services/Services/Turtle.cs:109:17
                 }
             }
 
-            if (!isHitMine && !isExit) Result = "Still In Danger";
+            if (!isHitMine || !isExit) Result = "Still In Danger";
         }
         #endregion

[Killed] Negate expression
ESM.Services/Services/Turtle.cs:109:17
                 }
             }
 
-            if (!isHitMine && !isExit) Result = "Still In Danger";
+            if (!(!isHitMine && !isExit)) Result = "Still In Danger";
         }
         #endregion
