[Killed] Equality mutation
ESM.Services/Services/TurtleMoveService.cs:25:35
         /// <returns>Bool</returns>
         public bool IsObstacleHit(IPoint point, IEnumerable<IMine> mines)
         {
-            return mines.Any(x => x.Point.X == point.X && x.Point.Y == point.Y);
+            return mines.Any(x => x.Point.X != point.X  && x.Point.Y == point.Y);
         }
 

[Killed] Equality mutation
ESM.Services/Services/TurtleMoveService.cs:25:59
         /// <returns>Bool</returns>
         public bool IsObstacleHit(IPoint point, IEnumerable<IMine> mines)
         {
-            return mines.Any(x => x.Point.X == point.X && x.Point.Y == point.Y);
+            return mines.Any(x => x.Point.X == point.X && x.Point.Y != point.Y);
         }
 

[Killed] Equality mutation
ESM.Services/Services/TurtleMoveService.cs:36:47
         /// <returns></returns>
         public bool IsExit(IPoint point, IExit exit)
         {
-            return exit.Point.X == point.X && exit.Point.Y == point.Y;
+            return exit.Point.X == point.X && exit.Point.Y != point.Y;
         }
 

[Killed] Logical mutation
ESM.Services/Services/TurtleMoveService.cs:36:20
         /// <returns></returns>
         public bool IsExit(IPoint point, IExit exit)
         {
-            return exit.Point.X == point.X && exit.Point.Y == point.Y;
+            return exit.Point.X == point.X || exit.Point.Y == point.Y;
         }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
ESM.Services/Services/TurtleMoveService.cs:48:21
             switch (point.Direction)
             {
                 case Direction.North:
-                    point.Y += 1;
+                                        point.Y -=1;
                     break;
                 case Direction.West:

[NoCoverage] SubtractAssignmentExpression to AddAssignmentExpression mutation
ESM.Services/Services/TurtleMoveService.cs:51:21
                     point.Y += 1;
                     break;
                 case Direction.West:
-                    point.X -= 1;
+                                        point.X +=1;
                     break;
                 case Direction.South:

[Survived] SubtractAssignmentExpression to AddAssignmentExpression mutation
ESM.Services/Services/TurtleMoveService.cs:54:21
                     point.X -= 1;
                     break;
                 case Direction.South:
-                    point.Y -= 1;
+                                        point.Y +=1;
                     break;
                 case Direction.East:

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
ESM.Services/Services/TurtleMoveService.cs:57:21
                     point.Y -= 1;
                     break;
                 case Direction.East:
-                    point.X += 1;
+                                        point.X -=1;
                     break;
             }
