[Killed] String mutation
ESM.Services/Common/CommandParserService.cs:98:32
                 switch (value)
                 {
                     case "M":
-                        return "Move";
+                        return "";
                     case "R":
                         return "Right";

[Killed] String mutation
ESM.Services/Common/CommandParserService.cs:102:32
                     case "R":
                         return "Right";
                     case "L":
-                        return "Left";
+                        return "";
                     default:
                         throw new ApplicationException($"'{value}' is not a valid instruction");

[NoCoverage] String mutation
ESM.Services/Common/CommandParserService.cs:104:56
                     case "L":
                         return "Left";
                     default:
-                        throw new ApplicationException($"'{value}' is not a valid instruction");
+                        throw new ApplicationException($"");
                 }
             }

[Killed] Negate expression
ESM.Services/Common/CommandParserService.cs:122:17
         /// <returns>Commands</returns>
         public IEnumerable<ICommand> Parse(string instructions)
         {
-            if (string.IsNullOrWhiteSpace(instructions))
+            if (!(string.IsNullOrWhiteSpace(instructions)))
                 throw new ArgumentNullException(null,"Instructions parameter cannot be null or empty");
 

[Killed] Equality mutation
ESM.Services/Common/CommandParserService.cs:127:17
 
             var instructionLines = instructions.Split(new[] { Environment.NewLine }, StringSplitOptions.None);
 
-            if (instructionLines.Length < GameSettingsDefaults.MinimumFormatLength)
+            if (instructionLines.Length <= GameSettingsDefaults.MinimumFormatLength)
                 throw new ArgumentException($"The length of the settings cannot be lower than minimum length {GameSettingsDefaults.MinimumFormatLength}");
 

[Killed] Equality mutation
ESM.Services/Common/CommandParserService.cs:127:17
 
             var instructionLines = instructions.Split(new[] { Environment.NewLine }, StringSplitOptions.None);
 
-            if (instructionLines.Length < GameSettingsDefaults.MinimumFormatLength)
+            if (instructionLines.Length > GameSettingsDefaults.MinimumFormatLength)
                 throw new ArgumentException($"The length of the settings cannot be lower than minimum length {GameSettingsDefaults.MinimumFormatLength}");
 

[Killed] Linq method mutation (Skip() to Take())
ESM.Services/Common/CommandParserService.cs:178:45
 
             var movementInstructions = new StringBuilder();
 
-            foreach (var instructionLine in instructionLines.Skip(4))
+            foreach (var instructionLine in instructionLines.Take(4))
             {
                 var movements = Enum.GetValues(typeof(Movement)).Cast<Movement>().Select(x => x.ToString()).ToList();

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ESM.Services/Common/CommandParserService.cs:187:17
 
             }
 
-            if (!string.IsNullOrEmpty(movementInstructions.ToString()))
+            if (string.IsNullOrEmpty(movementInstructions.ToString()))
             {
                 commands.Add(ParseTurtleMoveCommand(movementInstructions.ToString().Trim()));
